content/words/refs-and-streams-2.md
+++
title = "Refs and Streams 2: Updating with an Endpoint"
author = ["Sam Pillsworth"]
tags = ["scala", "cats-effect", "fs2", "http4s", "rough-thoughts"]
draft = true
creator = "Emacs 28.1 (Org mode 9.6 + ox-hugo)"
+++

Oh, hello. Lets continue with our [ref and stream experiment](https://www.blerf.ca/words/refs-and-streams-1/) by writing and serving a minimal API
with [Http4s](https://http4s.org/).


## The Problem, A Recap {#the-problem-a-recap}

From the first post:

> We have some data, rows of recommendations. The data is stored on disk, and we want to write an API
> that will return rows based on some query. The data, for now, is small enough that it can be read
> into memory when we start the server. A different process will update the data on disk however, and
> we need that update to propagate to the server without disrupting running requests. The update is
> the piece I’ve been working on.

I'm continuing from last time by focusing now on the API:

-   how to use the `Ref` to construct a response?
-   how to update the `Ref` via a request?
-   how to link the Http4s `Server` with the scheduled updates?


## The Pieces {#the-pieces}

The method to update the `Ref` needed a few changes. The `prog` to do the actual updating is good;
however instead of running mulitple streams like in the previous example, we'll be using multiple
resources. So now I've decided to compile the stream to a resource and return a `Resource[IO,
Unit]`.

```scala
def scheduledUpdater(ref: Ref[IO, Int]): Resource[IO, Unit] = {
  val prog = ref
    .updateAndGet(i => i + 1)
    .flatMap(i => IO.println(s"scheduled update: added 1, ref value is now $i"))
  Stream.repeatEval(prog).metered(1.minute).compile.resource.drain
}
```

Instead of just printing the `Ref` value on a schedule, I wanted to make a curl request for the
current value. I also wanted to be able to set the value of the `Ref` arbitrarily via a request as
well. For that I wrote a 2-endpoint service:

```scala
def refService(ref: Ref[IO, Int]) = HttpRoutes.of[IO] {
  case GET -> Root / "ref" =>
    for {
      i    <- ref.get
      resp <- Ok(s"Current ref value is: $i")
    } yield resp
  case PUT -> Root / "ref" / IntVar(value) =>
    for {
      _    <- ref.set(value)
      resp <- Ok(s"Updated the ref value to: $value")
    } yield resp
}
```

Finally, similar to last time, the tricky part was figuring out how to stitch the scheduled update
together with something else (in this case the `Server` resource). The real MVP here is the call to
`Resource.both`, which "allocates two resources concurrently, and combines their results in a
tuple."[^fn:1] Then I can call `.useForever` on the tuple to have a forever-running server and
updater.

```scala
def run(args: List[String]): IO[ExitCode] = {
  val serverAndUpdater: Resource[IO, (Server, Unit)] = for {
    ref <- Resource.eval(Ref[IO].of(1))
    httpApp = Router("/" -> refService(ref)).orNotFound
    updater = scheduledUpdater(ref)
    server = EmberServerBuilder
      .default[IO]
      .withHost(ipv4"0.0.0.0")
      .withPort(port"8080")
      .withHttpApp(httpApp)
      .build
    serverAndUpdater <- Resource.both(server, updater)
  } yield serverAndUpdater

  serverAndUpdater.useForever.as(ExitCode.Success)
}
```


## All The Code Together {#all-the-code-together}

All the pieces come together like so:[^fn:2]

```scala
//> using lib "co.fs2::fs2-core:3.4.0"
//> using lib "org.typelevel::cats-effect:3.4.4"
//
//> using lib "org.http4s::http4s-core:0.23.17"
//> using lib "org.http4s::http4s-dsl:0.23.17"
//> using lib "org.http4s::http4s-ember-server:0.23.17"
//> using lib "org.http4s::http4s-server:0.23.17"

import fs2.Stream
import cats.effect.IO
import cats.effect.IOApp
import scala.concurrent.duration._
import cats.effect.kernel.Ref

import org.http4s.HttpRoutes
import org.http4s.dsl.io._
import org.http4s.implicits._
import org.http4s.server.Router
import org.http4s.ember.server.EmberServerBuilder

import com.comcast.ip4s._
import cats.effect.ExitCode
import cats.effect.kernel.Resource
import org.http4s.server.Server

object ScheduledEndpoint extends IOApp {

  def refService(ref: Ref[IO, Int]) = HttpRoutes.of[IO] {
    case GET -> Root / "ref" =>
      for {
        i    <- ref.get
        resp <- Ok(s"Current ref value is: $i")
      } yield resp
    case PUT -> Root / "ref" / IntVar(value) =>
      for {
        _    <- ref.set(value)
        resp <- Ok(s"Updated the ref value to: $value")
      } yield resp
  }

  def scheduledUpdater(ref: Ref[IO, Int]): Resource[IO, Unit] = {
    val prog = ref
      .updateAndGet(i => i + 1)
      .flatMap(i => IO.println(s"scheduled update: added 1, ref value is now $i"))
    Stream.repeatEval(prog).metered(1.minute).compile.resource.drain
  }

  def run(args: List[String]): IO[ExitCode] = {
    val serverAndUpdater: Resource[IO, (Server, Unit)] = for {
      ref <- Resource.eval(Ref[IO].of(1))
      httpApp = Router("/" -> refService(ref)).orNotFound
      updater = scheduledUpdater(ref)
      server = EmberServerBuilder
        .default[IO]
        .withHost(ipv4"0.0.0.0")
        .withPort(port"8080")
        .withHttpApp(httpApp)
        .build
      serverAndUpdater <- Resource.both(server, updater)
    } yield serverAndUpdater

    serverAndUpdater.useForever.as(ExitCode.Success)
  }

}
```

And with that running, I can curl for the current value of the ref:

```shell
❯ curl 0.0.0.0:8080/ref
Current ref value is: 1%
```

Letting it sit and run for a while, I can see the ref getting updated:

```shell
scheduled update: added 1, ref value is now 2
scheduled update: added 1, ref value is now 3
```

I can get the updated ref value, and `PUT` a brand new value too:

```shell
❯ curl 0.0.0.0:8080/ref
Current ref value is: 3%

❯ curl -X PUT 0.0.0.0:8080/ref/42
Updated the ref value to: 42%

❯ curl 0.0.0.0:8080/ref
Current ref value is: 42%
```

Neat! At `$work`, the update function was a lot more complicated because it was a streaming request to read from a
GCS bucket (and a lot of error handling to go with it), and the lookup was more complicated because
we have more than just an integer. BUT the bones of this solution are what I've shipped and it's
going pretty well (touch wood, throw some salt over your left shoulder, etc. etc.).

[^fn:1]: Check out the [API docs](https://typelevel.org/cats-effect/api/3.x/cats/effect/kernel/Resource.html) (which I'm quoting) for more details
[^fn:2]: As before, this code is available as [a gist](https://gist.github.com/samspills/5a59db10a7d1b7b349fafae14cf42c3a). You can run it directly using [scala-cli](https://scala-cli.virtuslab.org/).